pftbest/msp430_svd/msp430-gcc-support-files/targetdb/Modules/msp430/TA0_356.0_inst7.xml
    <register id="TA0CCTL5" width="16" offset="0xC" internal="0" description="Timer_A Capture/Compare Control Register">
        <bitfield id="CCIFG" description="Capture/compare interrupt flag" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CCIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="CCIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="COV" description="Capture overflow" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="COV_0" value="0x0" description="No capture overflow occurred"/>
            <bitenum id="COV_1" value="0x1" description="Capture overflow occurred"/>
        </bitfield>
        <bitfield id="OUT" description="Output" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="LOW" value="0x0" description="Output low"/>
            <bitenum id="HIGH" value="0x1" description="Output high"/>
        </bitfield>
        <bitfield id="CCI" description="Capture/compare input" begin="3" end="3" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CCIE" description="Capture/compare interrupt enable" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="CCIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="CCIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="OUTMOD" description="Output mode" begin="7" end="5" width="3" rwaccess="R/W">
            <bitenum id="OUTMOD_0" value="0x0" description="OUT bit value"/>
            <bitenum id="OUTMOD_1" value="0x1" description="Set"/>
            <bitenum id="OUTMOD_2" value="0x2" description="Toggle/reset"/>
            <bitenum id="OUTMOD_3" value="0x3" description="Set/reset"/>
            <bitenum id="OUTMOD_4" value="0x4" description="Toggle"/>
            <bitenum id="OUTMOD_5" value="0x5" description="Reset"/>
            <bitenum id="OUTMOD_6" value="0x6" description="Toggle/set"/>
            <bitenum id="OUTMOD_7" value="0x7" description="Reset/set"/>
        </bitfield>
        <bitfield id="CAP" description="Capture mode" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="COMPARE" value="0x0" description="Compare mode"/>
            <bitenum id="CAPTURE" value="0x1" description="Capture mode"/>
        </bitfield>
        <bitfield id="SCCI" description="Synchronized capture/compare input" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SCS" description="Synchronize capture source" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="ASYNC" value="0x0" description="Asynchronous capture"/>
            <bitenum id="SYNC" value="0x1" description="Synchronous capture"/>
        </bitfield>
        <bitfield id="CCIS" description="Capture/compare input select" begin="13" end="12" width="2" rwaccess="R/W">
            <bitenum id="CCIA" value="0x0" description="CCIxA"/>
            <bitenum id="CCIB" value="0x1" description="CCIxB"/>
            <bitenum id="GND" value="0x2" description="GND"/>
            <bitenum id="VCC" value="0x3" description="VCC"/>
        </bitfield>
        <bitfield id="CM" description="Capture mode" begin="15" end="14" width="2" rwaccess="R/W">
            <bitenum id="NONE" value="0x0" description="No capture"/>
            <bitenum id="RISING" value="0x1" description="Capture on rising edge"/>
            <bitenum id="FALLING" value="0x2" description="Capture on falling edge"/>
            <bitenum id="BOTH" value="0x3" description="Capture on both rising and falling edges"/>
        </bitfield>
    </register>
    <register id="TA0CCTL6" width="16" offset="0xE" internal="0" description="Timer_A Capture/Compare Control Register">
        <bitfield id="CCIFG" description="Capture/compare interrupt flag" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CCIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="CCIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="COV" description="Capture overflow" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="COV_0" value="0x0" description="No capture overflow occurred"/>
            <bitenum id="COV_1" value="0x1" description="Capture overflow occurred"/>
        </bitfield>
        <bitfield id="OUT" description="Output" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="LOW" value="0x0" description="Output low"/>
            <bitenum id="HIGH" value="0x1" description="Output high"/>
        </bitfield>
        <bitfield id="CCI" description="Capture/compare input" begin="3" end="3" width="1" rwaccess="R">
        </bitfield>
        <bitfield id="CCIE" description="Capture/compare interrupt enable" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="CCIE_0" value="0x0" description="Interrupt disabled"/>
            <bitenum id="CCIE_1" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="OUTMOD" description="Output mode" begin="7" end="5" width="3" rwaccess="R/W">
            <bitenum id="OUTMOD_0" value="0x0" description="OUT bit value"/>
            <bitenum id="OUTMOD_1" value="0x1" description="Set"/>
            <bitenum id="OUTMOD_2" value="0x2" description="Toggle/reset"/>
            <bitenum id="OUTMOD_3" value="0x3" description="Set/reset"/>
            <bitenum id="OUTMOD_4" value="0x4" description="Toggle"/>
            <bitenum id="OUTMOD_5" value="0x5" description="Reset"/>
            <bitenum id="OUTMOD_6" value="0x6" description="Toggle/set"/>
            <bitenum id="OUTMOD_7" value="0x7" description="Reset/set"/>
        </bitfield>
        <bitfield id="CAP" description="Capture mode" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="COMPARE" value="0x0" description="Compare mode"/>
            <bitenum id="CAPTURE" value="0x1" description="Capture mode"/>
        </bitfield>
        <bitfield id="SCCI" description="Synchronized capture/compare input" begin="10" end="10" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="SCS" description="Synchronize capture source" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="ASYNC" value="0x0" description="Asynchronous capture"/>
            <bitenum id="SYNC" value="0x1" description="Synchronous capture"/>
        </bitfield>
        <bitfield id="CCIS" description="Capture/compare input select" begin="13" end="12" width="2" rwaccess="R/W">
            <bitenum id="CCIA" value="0x0" description="CCIxA"/>
            <bitenum id="CCIB" value="0x1" description="CCIxB"/>
            <bitenum id="GND" value="0x2" description="GND"/>
            <bitenum id="VCC" value="0x3" description="VCC"/>
        </bitfield>
        <bitfield id="CM" description="Capture mode" begin="15" end="14" width="2" rwaccess="R/W">
            <bitenum id="NONE" value="0x0" description="No capture"/>
            <bitenum id="RISING" value="0x1" description="Capture on rising edge"/>
            <bitenum id="FALLING" value="0x2" description="Capture on falling edge"/>
            <bitenum id="BOTH" value="0x3" description="Capture on both rising and falling edges"/>
        </bitfield>
    </register>
    <register id="TA0R" width="16" offset="0x10" internal="0" description="TimerA register">
    </register>
